### 6.1. Reading Text Files

In [1]:
with open("E:\Datasets\simple_textfile.txt") as f:
    lines = f.readlines()

len(lines)

23

In [2]:
import pandas as pd
sentence = pd.DataFrame({'Sentences':lines})
sentence.head()

                                           Sentences
0  In the early days, many language-processing sy...
1                                                 \n
2  Since the so-called "statistical revolution"[1...
3  The machine-learning paradigm calls instead fo...
4  is a set of documents, possibly with human or ...

### 6.2. Reading CSV Files

In [3]:
import pandas as pd 
patients_csv = pd.read_csv(r"E:\Datasets\yelp_reviews.csv", encoding = "utf-8")
patients_csv.head()

,review_id,user_id,business_id,stars,date,text,useful,funny,cool
0,vkVSCC7xljjrAI4UGfnKEQ,bv2nCi5Qv5vroFiqKGopiw,AEx2SYEUJmTxVVB18LlCwA,5,2016-05-28,Super simple place but amazing nonetheless. It...,0,0,0
1,n6QzIUObkYshz4dz2QRJTw,bv2nCi5Qv5vroFiqKGopiw,VR6GpWIda3SfvPC-lg9H3w,5,2016-05-28,Small unassuming place that changes their menu...,0,0,0
2,MV3CcKScW05u5LVfF6ok0g,bv2nCi5Qv5vroFiqKGopiw,CKC0-MOWMqoeWf6s-szl8g,5,2016-05-28,Lester's is located in a beautiful neighborhoo...,0,0,0
3,IXvOzsEMYtiJI0CARmj77Q,bv2nCi5Qv5vroFiqKGopiw,ACFtxLv8pGrrxMm6EgjreA,4,2016-05-28,Love coming here. Yes the place always needs t...,0,0,0
4,L_9BTb55X0GDtThi6GlZ6w,bv2nCi5Qv5vroFiqKGopiw,s2I_Ni76bjJNK9yG60iD-Q,4,2016-05-28,Had their chocolate almond croissant and it wa...,0,0,0

### 6.3. Reading TSV Files

In [4]:
import pandas as pd 
patients_csv = pd.read_csv(r"E:\Datasets\rt_reviews.tsv", sep='\t')
patients_csv.head()

,PhraseId,SentenceId,Phrase,Sentiment
0,1,1,A series of escapades demonstrating the adage ...,1
1,2,1,A series of escapades demonstrating the adage ...,2
2,3,1,A series,2
3,4,1,A,2
4,5,1,series,2

### 6.4. Importing Data From Databases

#### 6.4.1. Importing Data from SQL Server

In [5]:
# pip install pyodbc

In [6]:
import pandas as pd
import pyodbc
 
sql_conn = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server}; SERVER=DESKTOP-IIBLKH1\SQLEXPRESS; DATABASE=Hospital;   Trusted_Connection=yes')

In [7]:
query = "SELECT * FROM Patients;"
patients_data_ss = pd.read_sql(query, sql_conn)
patients_data_ss.head()

,Id,Name,Age,Gender,Nationality,Married,Comments
0,1,Rooney Moss,48,1,Peru,True,"Maecenas iaculis aliquet diam. Sed diam lorem,..."
1,2,Cole Gallegos,45,0,Mauritius,False,"egestas, urna justo faucibus lectus, a sollici..."
2,3,Dieter Glenn,67,1,Canada,True,nunc interdum feugiat. Sed nec metus facilisis...
3,4,Elton Durham,54,0,Congo (Brazzaville),True,Nunc sollicitudin commodo ipsum. Suspendisse n...
4,5,Ashton Larson,88,1,Monaco,True,molestie dapibus ligula. Aliquam erat volutpat...

#### 6.4.2. Importing Data from PostgreSQL

In [8]:
# pip install SQLAlchemy

In [9]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:abc123@localhost:5432/Hospital')

In [10]:
import pandas as pd
patients_data_psg =pd.read_sql_query('select * from "Patients"',con=engine)
patients_data_psg.head()

,id,name,age,gender,nationality,married,comments
0,1,Adrian Burns,22,1,Bermuda,True,"dolor, nonummy ac, feugiat non, lobortis quis,..."
1,2,George Padilla,55,1,Paraguay,False,"Suspendisse aliquet, sem ut cursus luctus, ips..."
2,3,Stephen Marks,12,0,Western Sahara,True,egestas. Aliquam nec enim. Nunc ut erat. Sed n...
3,4,Rahim York,74,1,Thailand,False,consectetuer euismod est arcu ac orci. Ut semp...
4,5,Edward Medina,61,1,Svalbard and Jan Mayen Islands,True,In faucibus. Morbi vehicula. Pellentesque tinc...

In [11]:
patients_data_psg["comments"][0]

'dolor, nonummy ac, feugiat non, lobortis quis, pede. Suspendisse dui. Fusce diam nunc, ullamcorper eu, euismod ac, fermentum vel, mauris. Integer sem elit, pharetra ut, pharetra sed, hendrerit a, arcu. Sed et libero. Proin mi. Aliquam gravida mauris ut mi. Duis risus odio, auctor vitae, aliquet nec, imperdiet nec, leo.'

#### 6.4.3. Importing Data from SQLite

In [12]:
import sqlite3
import pandas as pd
# Create your connection.
cnx = sqlite3.connect('E:/Hospital.db')

In [13]:
patients_data_sl = pd.read_sql_query("SELECT * FROM Patients", cnx)
patients_data_sl.head()

,Id,Name,Age,Gender,Nationality,Married,Comments
0,1,Melvin Moreno,89,0,Palau,True,"nunc, ullamcorper eu, euismod ac, fermentum ve..."
1,2,Nissim Erickson,73,1,CuraÃ§ao,False,Mauris blandit enim consequat purus. Maecenas ...
2,3,Vincent Morton,77,1,Palau,True,"aliquam iaculis, lacus pede sagittis augue, eu..."
3,4,Erasmus Browning,51,1,"Virgin Islands, British",False,Nulla tempor augue ac ipsum. Phasellus vitae m...
4,5,Elton Osborne,14,0,Dominican Republic,True,Mauris vel turpis. Aliquam adipiscing lobortis...

### 6.5. Scraping Data From Twitter

In [14]:
#pip install tweepy

In [15]:

import tweepy
import re
 
from tweepy import OAuthHandler
 
api_key = 'D5CvS7MrSfSoigFQFkQ5sioi4'
api_sec = 'ci9IHZPJ2l8oX4rIolOzv359sq7iQ5vPVGuVHJW96IWIT3nyzD' 
acc_tok = '165879850-d6GPXrp2nhM6qJG2lKleOcCJSZRhED435N8sgxD8'
acc_tok_sec ='kQsvtXf5pajEiqT6L2HOpxN9BYakrWDOHmsMKo0C6j18U'

In [16]:

api_handler = OAuthHandler(api_key, api_sec)
api_handler.set_access_token(acc_tok, acc_tok_sec)

In [17]:

api_object = tweepy.API(api_handler ,timeout=10)
 
tweets_list = []
 
search_string = 'facebook'
 
cursor = tweepy.Cursor(api_object.search, q=search_string+" -filter:retweets",lang='en',result_type='recent').items(200)
    
for single_tweet in cursor:
    tweets_list.append(single_tweet.text)

In [18]:
tweets = pd.DataFrame({'Tweets':tweets_list})
tweets.head()

                                              Tweets
0  If you follow anyone associated with our site ...
1  @bluehatman Sky News Australia is the one I fo...
2  Facebook is introducing a new tool to help use...
3  America ðŸ‡ºðŸ‡¸ \nWhite Cop kneels on arrested &amp...
4  @mariafeldman14 @mattickus @SilasATaylor @NYCM...

## Exercise 6.1

**Question 1:**

Which delimiter is used to read TSV file with Pandas read_csv method:

A. sep ='tab' 

B. sep = '    '

C. sep ='\t'

D. None of the Above


**Answer**: C


**Question 2:**

Which Python module is used to import data from SQL Server:

A. SqlAlchemy

B. pyodbc

C. sqlite3

D. None of the Above


**Answer**: B


**Question 2:**

Which function is used to convert a database table to a pandas dataframe:

A. pd.read_sql_query

B. pd.read_sql

C. pd.read_csv

D. pd.read_tsv


**Answer**: A

## Exercise 6.2

In the "Resources/Datasets" folder, you will find a file CSV "airline_review". Read the CSV file, and print the first 5 reviews. You can use the head method of the Pandas dataframe for that purpose.

**Solution:**

In [22]:
import pandas as pd 
airline_csv = pd.read_csv(r"E:\Datasets\airline_review.csv", encoding = "utf-8")
for i in range(5):
    print(airline_csv["text"][i])

@VirginAmerica What @dhepburn said.
@VirginAmerica plus you've added commercials to the experience... tacky.
@VirginAmerica I didn't today... Must mean I need to take another trip!
@VirginAmerica it's really aggressive to blast obnoxious "entertainment" in your guests' faces &amp; they have little recourse
@VirginAmerica and it's a really big bad thing about it